## Pandas: A library for manipulating tables

### Series

In [1]:
import pandas as pd

In [2]:
xS = pd.Series([10,20,30])
print(type(xS))
xS

<class 'pandas.core.series.Series'>

0    10
1    20
2    30
dtype: int64

In [3]:
xS[0] = 15
xS

0    15
1    20
2    30
dtype: int64

*Series* are more like *dictionaries*. The index set need not be integers.

In [4]:
xS = pd.Series([10,20,30],index=["a","b","c"])
xS

a    10
b    20
c    30
dtype: int64

The index set need not be even unique!

In [9]:
xS = pd.Series([10,20,30,40],index=['a','b','c','a'])
xS

a    10
b    20
c    30
a    40
dtype: int64

In [10]:
xS['a'] = 15     # replace all entries associated with 'a' 
xS

a    15
b    20
c    30
a    15
dtype: int64

In [6]:
print(xS['b'])
print(type(xS['b']))

20
<class 'numpy.int64'>

In [ ]:
print(xS['a'])
print(type(xS['a']))          # if there is more than only entry it returns a series

In [ ]:
print(xS[['b','c']])         # you can also supply a list of indices. You get a series

#### Scalar Operations

In [11]:
xS = xS + 10
print(xS)

a    25
b    30
c    40
a    25
dtype: int64

In [12]:
xS = xS * 10
print(xS)

a    250
b    300
c    400
a    250
dtype: int64

In [13]:
import numpy as np

In [14]:
xS.apply(np.log)      # apply a function on each element of a series. Like map

a    5.521461
b    5.703782
c    5.991465
a    5.521461
dtype: float64

In [15]:
print(xS)       # Leaves xS unchanged

a    250
b    300
c    400
a    250
dtype: int64

In [16]:
x = [0,1,2,3,None]
y = ["a","b","c","a","d"]
zS = pd.Series(x,index=y)

In [17]:
print(zS)       # unknown values are Not a Number of NaN

a    0.0
b    1.0
c    2.0
a    3.0
d    NaN
dtype: float64

In [18]:
x = {"a":1, "b":2, "c":3}         # Series from a Dictionary

In [19]:
zS = pd.Series(x)

In [20]:
print(zS)

a    1
b    2
c    3
dtype: int64

In [32]:
zS = pd.Series(x,index=y)

In [33]:
print(zS)   # Sets all undefined indices to NaN

a    1.0
b    2.0
c    3.0
a    1.0
d    NaN
dtype: float64

In [36]:
zS.fillna({"e":17})     # replace a NaN with a value Does NOT change zS.

a    1.0
b    2.0
c    3.0
a    1.0
d    NaN
dtype: float64

In [25]:
print(zS)

a    1.0
b    2.0
c    3.0
a    1.0
d    NaN
dtype: float64

In [30]:
zS.fillna({"d":10},inplace=True)   # if you want to change zS

In [31]:
print(zS)

a     1.0
b     2.0
c     3.0
a     1.0
d    10.0
dtype: float64

**Exercise:** What happens if you call **fillna** at (i) an index which is not NaN (ii) something that is not an index? Experiment with **pandas** and findout.

nothing happens in both cases

In [38]:
pd.concat([zS,zS])   # As expected

a    1.0
b    2.0
c    3.0
a    1.0
d    NaN
a    1.0
b    2.0
c    3.0
a    1.0
d    NaN
dtype: float64

###  DataFrames : When you want more than a series

In [52]:
markList1 = pd.Series({"s1":10,"s2":19,"s3":14})
markList2 = pd.Series({"s1":19, "s2":8,"s3":12})
markList = pd.concat([markList1,markList2],axis=1)

In [53]:
print(type(markList))
markList

<class 'pandas.core.frame.DataFrame'>

     0   1
s1  10  19
s2  19   8
s3  14  12

In [43]:
print(markList)          # The rendering above is by Jupyter. The string version is below

     0   1
s1  10  19
s2  19   8
s3  14  12

In [44]:
markList1['s1'] = 75
markList                      # No effect on markList

     0   1
s1  10  19
s2  19   8
s3  14  12

In [45]:
markList1.name = "Test 1"       # Series can be given names
markList2.name = "Test 2"

In [49]:
markList = pd.concat([markList1,markList2],axis=1)
print(markList)
markList.columns

    Test 1  Test 2
s1      75      19
s2      19       8
s3      14      12

Index(['Test 1', 'Test 2'], dtype='object')

Tells you that the colums are now index by Test 1 and Test 2

In [54]:
markList = pd.concat([markList1,markList2],axis=1)
markList.columns=["Test1","Test2"]  # You can also set the column indices explicitely

In [55]:
markList

    Test1  Test2
s1     10     19
s2     19      8
s3     14     12

You can also create a DataFrame by providing a dictionary of columns

In [56]:
markList = pd.DataFrame({"Test 1":[10,19,14], "Test 2":[8,19,12]})

In [57]:
markList

   Test 1  Test 2
0      10       8
1      19      19
2      14      12

You can specify the names for the rows and ordering for the columns

In [58]:
markList = pd.DataFrame({"Test 1":[10,19,14], "Test 2":[8,19,12]},index=["s1","s2","s3"],columns=["Test 2","Test 1"])

In [59]:
markList

    Test 2  Test 1
s1       8      10
s2      19      19
s3      12      14

You can start with the indices as just another column ....

In [64]:
markList = pd.DataFrame({"Names":["s1","s2","s3"], "Test 1":[10,19,14], "Test 2":[8,19,12]})
markList

  Names  Test 1  Test 2
0    s1      10       8
1    s2      19      19
2    s3      14      12

... and then set the index

In [65]:
markList.set_index("Names",inplace=True)      # This is how we turn a column into the index
markList

       Test 1  Test 2
Names
s1         10       8
s2         19      19
s3         14      12

In [82]:
marklist=markList.reindex(index=["s2","s3","s1"])    # You can reorder the rows by reindexing. 
markList

       Test 1  Test 2
Names
s1         10       8
s2         19      19
s3         14      12

In [69]:
markList.reindex(index=["s1","s3","s4","s2"],inplace=True)    # Alas no inplace

TypeError: reindex() got an unexpected keyword argument "inplace"

#### Experiments with Files

Pandas works with most spreadsheet files directly. Here we use CSV files.

In [83]:
c1t1 = pd.read_csv("T:\python_DS\Lecture 13-20191020\csvs/Course01Test01.csv")          # load a csv file as a DataFrame. First row is treated as column names

You can indicate the delimiter (instead of commas which is the default) via the parameter **sep**. You can also treat all rows the same (and treat columns are unlabelled) via the parameter **header** and so on. Look up the documentation for all this and more.

In [84]:
print(c1t1)

  UserID First Name Last Name  Marks
0  uid01    Fname01   Lname01     12
1  uid02    Fname02   Lname02     18
2  uid03    Fname03   Lname03     11
3  uid04    Fname04   Lname04     12
4  uid05    Fname05   Lname05     19
5  uid06    Fname06   Lname06     23
6  uid07    Fname07   Lname07      8
7  uid08    Fname08   Lname08     12
8  uid09    Fname09   Lname09     15
9  uid10    Fname10   Lname10     19

In [85]:
tmp = c1t1.set_index(["First Name","Last Name"])     # You can use multiple columns to index.

In [86]:
tmp["UserID"]     # list of userids indexed by firstname,lastname

First Name  Last Name
Fname01     Lname01      uid01
Fname02     Lname02      uid02
Fname03     Lname03      uid03
Fname04     Lname04      uid04
Fname05     Lname05      uid05
Fname06     Lname06      uid06
Fname07     Lname07      uid07
Fname08     Lname08      uid08
Fname09     Lname09      uid09
Fname10     Lname10      uid10
Name: UserID, dtype: object

We shall use **UserID** as the primary key (unique identifier) and create our tables. Our aim is to combine the tables coming from all the tests into one. Then combine tables across multiple courses etc.

In [87]:
c1t1.set_index("UserID", inplace=True)

In [91]:
c1t2 = pd.read_csv("T:\python_DS\Lecture 13-20191020\csvs/Course01Test02.csv")
c1t3 = pd.read_csv("T:\python_DS\Lecture 13-20191020\csvs/Course01Test03.csv")
c1t4 = pd.read_csv("T:\python_DS\Lecture 13-20191020\csvs/Course01Test04.csv")
c1t2.set_index("UserID",inplace=True)
c1t3.set_index("UserID",inplace=True)
c1t4.set_index("UserID",inplace=True)

In [92]:
names = c1t1[["First Name","Last Name"]]        # Make a table relating UseID to Names.
print(names)

       First Name Last Name
UserID
uid01     Fname01   Lname01
uid02     Fname02   Lname02
uid03     Fname03   Lname03
uid04     Fname04   Lname04
uid05     Fname05   Lname05
uid06     Fname06   Lname06
uid07     Fname07   Lname07
uid08     Fname08   Lname08
uid09     Fname09   Lname09
uid10     Fname10   Lname10

In [93]:
c1t1m = c1t1["Marks"]                           # Course 01 Test 01 Marks indexed by UserID
print(c1t1m)

UserID
uid01    12
uid02    18
uid03    11
uid04    12
uid05    19
uid06    23
uid07     8
uid08    12
uid09    15
uid10    19
Name: Marks, dtype: int64

In [94]:
c1t2m = c1t2["Marks"]
c1t3m = c1t3["Marks"]
c1t4m = c1t4["Marks"]

In [95]:
c1mlist = pd.concat([names,c1t1m,c1t2m,c1t3m,c1t4m],axis=1)      # A single combined table listing all test marks

In [96]:
c1mlist          # Ugh, all the four test mark columns are labelled Marks

       First Name Last Name  Marks  Marks  Marks  Marks
UserID
uid01     Fname01   Lname01     12     14      8     14
uid02     Fname02   Lname02     18     13     19     11
uid03     Fname03   Lname03     11     19     12     12
uid04     Fname04   Lname04     12     10     19     15
uid05     Fname05   Lname05     19     18     19     19
uid06     Fname06   Lname06     23     19     21     18
uid07     Fname07   Lname07      8     11     11     10
uid08     Fname08   Lname08     12      8     13     10
uid09     Fname09   Lname09     15     11     16     17
uid10     Fname10   Lname10     19     10     17     18

In [97]:
c1mlist.columns = ["First Name","Last Name", "Test 1","Test 2","Test 3", "Test 4"]   # This how we fix that

In [98]:
c1mlist

       First Name Last Name  Test 1  Test 2  Test 3  Test 4
UserID
uid01     Fname01   Lname01      12      14       8      14
uid02     Fname02   Lname02      18      13      19      11
uid03     Fname03   Lname03      11      19      12      12
uid04     Fname04   Lname04      12      10      19      15
uid05     Fname05   Lname05      19      18      19      19
uid06     Fname06   Lname06      23      19      21      18
uid07     Fname07   Lname07       8      11      11      10
uid08     Fname08   Lname08      12       8      13      10
uid09     Fname09   Lname09      15      11      16      17
uid10     Fname10   Lname10      19      10      17      18

In [99]:
c1mlist.insert(loc=6,column="Total",value=None)         # adding a total column. Initialized to Nones.

In [ ]:
c1mlist

In [100]:
c1mlist["Total"] = c1mlist["Test 1"] + c1mlist["Test 2"] + c1mlist["Test 3"] + c1mlist["Test 4"]   # set Total values

In [101]:
c1mlist

       First Name Last Name  Test 1  Test 2  Test 3  Test 4  Total
UserID
uid01     Fname01   Lname01      12      14       8      14     48
uid02     Fname02   Lname02      18      13      19      11     61
uid03     Fname03   Lname03      11      19      12      12     54
uid04     Fname04   Lname04      12      10      19      15     56
uid05     Fname05   Lname05      19      18      19      19     75
uid06     Fname06   Lname06      23      19      21      18     81
uid07     Fname07   Lname07       8      11      11      10     40
uid08     Fname08   Lname08      12       8      13      10     43
uid09     Fname09   Lname09      15      11      16      17     59
uid10     Fname10   Lname10      19      10      17      18     64

In [102]:
c1mlist[["Test 1","Test 2","Test 3","Test 4","Total"]]   # you can of course pick out which ever columns you want easily

        Test 1  Test 2  Test 3  Test 4  Total
UserID
uid01       12      14       8      14     48
uid02       18      13      19      11     61
uid03       11      19      12      12     54
uid04       12      10      19      15     56
uid05       19      18      19      19     75
uid06       23      19      21      18     81
uid07        8      11      11      10     40
uid08       12       8      13      10     43
uid09       15      11      16      17     59
uid10       19      10      17      18     64

In [104]:
print(c1mlist.loc["uid04"])               # pick out a row

First Name    Fname04
Last Name     Lname04
Test 1             12
Test 2             10
Test 3             19
Test 4             15
Total              56
Name: uid04, dtype: object

In [105]:
print(c1mlist.loc[c1mlist.Total > 60])    # this is how you pick rows satisfying some condition

       First Name Last Name  Test 1  Test 2  Test 3  Test 4  Total
UserID
uid02     Fname02   Lname02      18      13      19      11     61
uid05     Fname05   Lname05      19      18      19      19     75
uid06     Fname06   Lname06      23      19      21      18     81
uid10     Fname10   Lname10      19      10      17      18     64

Time to bring on the second course.

In [106]:
c2t1 = pd.read_csv("T:\python_DS\Lecture 13-20191020\csvs/Course02Test01.csv")
c2t2 = pd.read_csv("T:\python_DS\Lecture 13-20191020\csvs/Course02Test02.csv")
c2t3 = pd.read_csv("T:\python_DS\Lecture 13-20191020\csvs/Course02Test03.csv")
c2t4 = pd.read_csv("T:\python_DS\Lecture 13-20191020\csvs/Course02Test04.csv")

In [107]:
c2t1.set_index("UserID", inplace=True)
c2t2.set_index("UserID",inplace=True)
c2t3.set_index("UserID",inplace=True)
c2t4.set_index("UserID",inplace=True)

In [123]:
c2t1m = c2t1["Marks"]
c2t2m = c2t2["Marks"]
c2t3m = c2t3["Marks"]
c2t4m = c2t4["Marks"]

In [109]:
c2mlist = pd.concat([names,c2t1m,c2t2m,c2t3m,c2t4m],axis=1)
c2mlist.columns = ["First Name","Last Name", "Test 1","Test 2","Test 3", "Test 4"]
c2mlist.insert(loc=6,column="Total",value=None)
c2mlist["Total"] = c2mlist["Test 1"] + c2mlist["Test 2"] + c2mlist["Test 3"] + c2mlist["Test 4"]

In [110]:
c2mlist   # finally we have massaged Course 2 like Course 1

       First Name Last Name  Test 1  Test 2  Test 3  Test 4  Total
UserID
uid01     Fname01   Lname01      14       8      14      12     48
uid02     Fname02   Lname02      11      19      13      18     61
uid03     Fname03   Lname03      12      12      19      11     54
uid04     Fname04   Lname04      15      19      10      12     56
uid05     Fname05   Lname05      19      19      18      19     75
uid06     Fname06   Lname06      18      21      19      23     81
uid07     Fname07   Lname07      10      11      11       8     40
uid08     Fname08   Lname08      10      13       8      12     43
uid09     Fname09   Lname09      17      16      11      15     59
uid10     Fname10   Lname10      18      17      10      19     64

In [111]:
c1simple = c1mlist[["Test 1","Test 2","Test 3","Test 4","Total"]]     # Omit Names

In [112]:
c2simple = c1mlist[["Test 1","Test 2","Test 3","Test 4","Total"]]     # Omit Names

In [113]:
combined = pd.concat([c1simple,c2simple],keys=["Course 01","Course 02"],axis=1)   # Combine, tagging columns of each with name.

In [114]:
combined

       Course 01                            Course 02                       \
          Test 1 Test 2 Test 3 Test 4 Total    Test 1 Test 2 Test 3 Test 4
UserID
uid01         12     14      8     14    48        12     14      8     14
uid02         18     13     19     11    61        18     13     19     11
uid03         11     19     12     12    54        11     19     12     12
uid04         12     10     19     15    56        12     10     19     15
uid05         19     18     19     19    75        19     18     19     19
uid06         23     19     21     18    81        23     19     21     18
uid07          8     11     11     10    40         8     11     11     10
uid08         12      8     13     10    43        12      8     13     10
uid09         15     11     16     17    59        15     11     16     17
uid10         19     10     17     18    64        19     10     17     18


       Total
UserID
uid01     48
uid02     61
uid03     54
uid04     56
uid05     75
uid06     81
uid07     40
uid08     43
uid09     59
uid10     64

In [115]:
print(combined)      # tags are inserted to all rows they tag

       Course 01                            Course 02                       \
          Test 1 Test 2 Test 3 Test 4 Total    Test 1 Test 2 Test 3 Test 4
UserID
uid01         12     14      8     14    48        12     14      8     14
uid02         18     13     19     11    61        18     13     19     11
uid03         11     19     12     12    54        11     19     12     12
uid04         12     10     19     15    56        12     10     19     15
uid05         19     18     19     19    75        19     18     19     19
uid06         23     19     21     18    81        23     19     21     18
uid07          8     11     11     10    40         8     11     11     10
uid08         12      8     13     10    43        12      8     13     10
uid09         15     11     16     17    59        15     11     16     17
uid10         19     10     17     18    64        19     10     17     18


       Total
UserID
uid01     48
uid02     61
uid03     54
uid04     56
uid05     75
uid06     81
uid07     40
uid08     43
uid09     59
uid10     64

In [129]:
altcombine = pd.concat([c1simple.T,c2simple.T],keys=["Course 01","Course 02"])   # Doing it row-wise after transpose

In [130]:
altcombine

UserID            uid01  uid02  uid03  uid04  uid05  uid06  uid07  uid08  \
Course 01 Test 1     12     18     11     12     19     23      8     12
          Test 2     14     13     19     10     18     19     11      8
          Test 3      8     19     12     19     19     21     11     13
          Test 4     14     11     12     15     19     18     10     10
          Total      48     61     54     56     75     81     40     43
Course 02 Test 1     12     18     11     12     19     23      8     12
          Test 2     14     13     19     10     18     19     11      8
          Test 3      8     19     12     19     19     21     11     13
          Test 4     14     11     12     15     19     18     10     10
          Total      48     61     54     56     75     81     40     43

UserID            uid09  uid10
Course 01 Test 1     15     19
          Test 2     11     10
          Test 3     16     17
          Test 4     17     18
          Total      59     64
Course 02 Test 1     15     19
          Test 2     11     10
          Test 3     16     17
          Test 4     17     18
          Total      59     64

In [131]:
altcombine = altcombine.swaplevel()          # Switch the tests and courses columns
altcombine

,UserID,uid01,uid02,uid03,uid04,uid05,uid06,uid07,uid08,uid09,uid10
Test 1,Course 01,12,18,11,12,19,23,8,12,15,19
Test 2,Course 01,14,13,19,10,18,19,11,8,11,10
Test 3,Course 01,8,19,12,19,19,21,11,13,16,17
Test 4,Course 01,14,11,12,15,19,18,10,10,17,18
Total,Course 01,48,61,54,56,75,81,40,43,59,64
Test 1,Course 02,12,18,11,12,19,23,8,12,15,19
Test 2,Course 02,14,13,19,10,18,19,11,8,11,10
Test 3,Course 02,8,19,12,19,19,21,11,13,16,17
Test 4,Course 02,14,11,12,15,19,18,10,10,17,18
Total,Course 02,48,61,54,56,75,81,40,43,59,64

In [132]:
altcombine.sort_index(inplace=True)          # sort by tests (the index now)
altcombine

UserID            uid01  uid02  uid03  uid04  uid05  uid06  uid07  uid08  \
Test 1 Course 01     12     18     11     12     19     23      8     12
       Course 02     12     18     11     12     19     23      8     12
Test 2 Course 01     14     13     19     10     18     19     11      8
       Course 02     14     13     19     10     18     19     11      8
Test 3 Course 01      8     19     12     19     19     21     11     13
       Course 02      8     19     12     19     19     21     11     13
Test 4 Course 01     14     11     12     15     19     18     10     10
       Course 02     14     11     12     15     19     18     10     10
Total  Course 01     48     61     54     56     75     81     40     43
       Course 02     48     61     54     56     75     81     40     43

UserID            uid09  uid10
Test 1 Course 01     15     19
       Course 02     15     19
Test 2 Course 01     11     10
       Course 02     11     10
Test 3 Course 01     16     17
       Course 02     16     17
Test 4 Course 01     17     18
       Course 02     17     18
Total  Course 01     59     64
       Course 02     59     64

In [120]:
altcombine.T

          Test 1              Test 2              Test 3              Test 4  \
       Course 01 Course 02 Course 01 Course 02 Course 01 Course 02 Course 01
UserID
uid01         12        12        14        14         8         8        14
uid02         18        18        13        13        19        19        11
uid03         11        11        19        19        12        12        12
uid04         12        12        10        10        19        19        15
uid05         19        19        18        18        19        19        19
uid06         23        23        19        19        21        21        18
uid07          8         8        11        11        11        11        10
uid08         12        12         8         8        13        13        10
uid09         15        15        11        11        16        16        17
uid10         19        19        10        10        17        17        18

                     Total
       Course 02 Course 01 Course 02
UserID
uid01         14        48        48
uid02         11        61        61
uid03         12        54        54
uid04         15        56        56
uid05         19        75        75
uid06         18        81        81
uid07         10        40        40
uid08         10        43        43
uid09         17        59        59
uid10         18        64        64

We can also write our new table to a file easily.

In [121]:
altcombine.to_csv("T:\python_DS\Lecture 13-20191020\csvs/altcombined.csv")